summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxDsadc_regdef.h
/**
 * \file IfxDsadc_regdef.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1585 $
 * $Date: 2013-09-03 13:30:24 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Dsadc Dsadc
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Dsadc_Bitfields Bitfields
 * \ingroup IfxLld_Dsadc
 * 
 * \defgroup IfxLld_Dsadc_union Union
 * \ingroup IfxLld_Dsadc
 * 
 * \defgroup IfxLld_Dsadc_struct Struct
 * \ingroup IfxLld_Dsadc
 * 
 */
#ifndef IFXDSADC_REGDEF_H
#define IFXDSADC_REGDEF_H
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Dsadc_Bitfields
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef struct _Ifx_DSADC_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access E0able for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access E1able for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access E2able for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access E3able for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access E4able for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access E5able for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access E6able for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access E7able for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access E8able for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access E9able for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access E10able for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access E11able for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access E12able for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access E13able for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access E14able for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access E15able for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access E16able for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access E17able for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access E18able for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access E19able for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access E20able for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access E21able for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access E22able for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access E23able for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access E24able for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access E25able for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access E26able for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access E27able for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access E28able for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access E29able for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access E30able for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access E31able for Master TAG ID n (rw) */
} Ifx_DSADC_ACCEN0_Bits;

/** \\brief  Access Protection Register */
typedef struct _Ifx_DSADC_ACCPROT_Bits
{
    unsigned int RG00:1;                    /**< \brief [0:0] Register Group 0, Channels 0, 2, 3 (rw) */
    unsigned int RG01:1;                    /**< \brief [1:1] Register Group 1, Channels 0, 2, 3 (rw) */
    unsigned int RG02:1;                    /**< \brief [2:2] Register Group 2, Channels 0, 2, 3 (rw) */
    unsigned int RG03:1;                    /**< \brief [3:3] Register Group 3, Channels 0, 2, 3 (rw) */
    unsigned int RG04:1;                    /**< \brief [4:4] Register Group 4, Channels 0, 2, 3 (rw) */
    unsigned int reserved_5:9;              /**< \brief \internal Reserved */
    unsigned int RG10:1;                    /**< \brief [14:14] Register Group 0/1, General Control (rw) */
    unsigned int RG11:1;                    /**< \brief [15:15] Register Group 0/1, General Control (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_DSADC_ACCPROT_Bits;

/** \\brief  Carrier Generator Configuration Register */
typedef struct _Ifx_DSADC_CGCFG_Bits
{
    unsigned int CGMOD:2;                   /**< \brief [1:0] Carrier Generator Operating Mode (rw) */
    unsigned int BREV:1;                    /**< \brief [2:2] Bit-Reverse PWM Generation (rw) */
    unsigned int SIGPOL:1;                  /**< \brief [3:3] Signal Polarity (rw) */
    unsigned int DIVCG:4;                   /**< \brief [7:4] Divider Factor for the PWM Pattern Signal Generator (rw) */
    unsigned int reserved_8:7;              /**< \brief \internal Reserved */
    unsigned int RUN:1;                     /**< \brief [15:15] Run Indicator (rh) */
    unsigned int BITCOUNT:5;                /**< \brief [20:16] Bit Counter (rh) */
    unsigned int reserved_21:3;             /**< \brief \internal Reserved */
    unsigned int STEPCOUNT:4;               /**< \brief [27:24] Step Counter (rh) */
    unsigned int STEPS:1;                   /**< \brief [28:28] Step Counter Sign (rh) */
    unsigned int STEPD:1;                   /**< \brief [29:29] Step Counter Direction (rh) */
    unsigned int SGNCG:1;                   /**< \brief [30:30] Sign Signal from Carrier Generator (rh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_DSADC_CGCFG_Bits;

/** \\brief  Boundary Select Register */
typedef struct _Ifx_DSADC_CH_BOUNDSEL_Bits
{
    unsigned int BOUNDARYL:16;              /**< \brief [15:0] Lower Boundary Value for Limit Checking (rw) */
    unsigned int BOUNDARYU:16;              /**< \brief [31:16] Upper Boundary Value for Limit Checking (rw) */
} Ifx_DSADC_CH_BOUNDSEL_Bits;

/** \\brief  Carrier Generator Synchronization Register */
typedef struct _Ifx_DSADC_CH_CGSYNC_Bits
{
    unsigned int SDCOUNT:8;                 /**< \brief [7:0] Sign Delay Counter (rh) */
    unsigned int SDCAP:8;                   /**< \brief [15:8] Sign Delay Capture Value (rh) */
    unsigned int SDPOS:8;                   /**< \brief [23:16] Sign Delay Value for Positive Halfwave (rw) */
    unsigned int SDNEG:8;                   /**< \brief [31:24] Sign Delay Value for Negative Halfwave (rw) */
} Ifx_DSADC_CH_CGSYNC_Bits;

/** \\brief  Demodulator Input Configuration Register */
typedef struct _Ifx_DSADC_CH_DICFG_Bits
{
    unsigned int DSRC:4;                    /**< \brief [3:0] Input Data Source Select (rw) */
    unsigned int reserved_4:3;              /**< \brief \internal Reserved */
    unsigned int DSWC:1;                    /**< \brief [7:7] Write Control for Data Selection (w) */
    unsigned int ITRMODE:2;                 /**< \brief [9:8] Integrator Trigger Mode (rw) */
    unsigned int TSTRMODE:2;                /**< \brief [11:10] Timestamp Trigger Mode (rw) */
    unsigned int TRSEL:3;                   /**< \brief [14:12] Trigger Select (rw) */
    unsigned int TRWC:1;                    /**< \brief [15:15] Write Control for Trigger Parameters (w) */
    unsigned int CSRC:4;                    /**< \brief [19:16] Sample Clock Source Select (rw) */
    unsigned int STROBE:4;                  /**< \brief [23:20] Data Strobe Generation Mode (rw) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int SCWC:1;                    /**< \brief [31:31] Write Control for Strobe/Clock Selection (w) */
} Ifx_DSADC_CH_DICFG_Bits;

/** \\brief  Filter Configuration Register, Auxiliary Filter */
typedef struct _Ifx_DSADC_CH_FCFGA_Bits
{
    unsigned int CFADF:8;                   /**< \brief [7:0] CIC Filter (Auxiliary) Decimation Factor (rw) */
    unsigned int CFAC:2;                    /**< \brief [9:8] CIC Filter (Auxiliary) Configuration (rw) */
    unsigned int SRGA:2;                    /**< \brief [11:10] Service Request Generation Auxiliary Filter (rw) */
    unsigned int ESEL:2;                    /**< \brief [13:12] Event Select (rw) */
    unsigned int EGT:1;                     /**< \brief [14:14] Event Gating (rw) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int AFSC:2;                    /**< \brief [17:16] Auxiliary Filter Shift Control (rw) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int CFADCNT:8;                 /**< \brief [31:24] CIC Filter (Auxiliary) Decimation Counter (rh) */
} Ifx_DSADC_CH_FCFGA_Bits;

/** \\brief  Filter Configuration Register, Main CIC Filter */
typedef struct _Ifx_DSADC_CH_FCFGC_Bits
{
    unsigned int CFMDF:8;                   /**< \brief [7:0] CIC Filter (Main Chain) Decimation Factor (rw) */
    unsigned int CFMC:2;                    /**< \brief [9:8] CIC Filter (Main Chain) Configuration (rw) */
    unsigned int CFEN:1;                    /**< \brief [10:10] CIC Filter Enable (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int MFSC:2;                    /**< \brief [13:12] Main Filter Shift Control (rw) */
    unsigned int SRGM:2;                    /**< \brief [15:14] Service Request Generation Main Chain (rw) */
    unsigned int CFMSV:8;                   /**< \brief [23:16] CIC Filter (Main Chain) Start Value (rw) */
    unsigned int CFMDCNT:8;                 /**< \brief [31:24] CIC Filter (Main Chain) Decimation Counter (rh) */
} Ifx_DSADC_CH_FCFGC_Bits;

